rahulsinghk998/BLE-1.3.2/CC254x Peripherals_Software_Examples/IAR_EW8051_8_11_CC254-3-4-5-Update/ioCC2543.h
SFR(  _SFRC8    ,  0xC8  )   /*  not used                                           */
SFR(  WDCTL     ,  0xC9  )   /*  Watchdog Timer Control                             */
SFR(  T3CNT     ,  0xCA  )   /*  Timer 3 Counter                                    */
SFR(  T3CTL     ,  0xCB  )   /*  Timer 3 Control                                    */
SFR(  T3CCTL0   ,  0xCC  )   /*  Timer 3 Channel 0 Capture/Compare Control          */
SFR(  T3CC0     ,  0xCD  )   /*  Timer 3 Channel 0 Capture/Compare Value            */
SFR(  T3CCTL1   ,  0xCE  )   /*  Timer 3 Channel 1 Capture/Compare Control          */
SFR(  T3CC1     ,  0xCF  )   /*  Timer 3 Channel 1 Capture/Compare Value            */

 /*  Program Status Word                                                            */
SFRBIT( PSW     ,  0xD0, CY, AC, F0, RS1, RS0, OV, F1, P )
SFR(  DMAIRQ    ,  0xD1  )   /*  DMA Interrupt Flag                                 */
SFR(  DMA1CFGL  ,  0xD2  )   /*  DMA Channel 1 Configuration Address Low Byte     */
SFR(  DMA1CFGH  ,  0xD3  )   /*  DMA Channel 1 Configuration Address High Byte    */
SFR(  DMA0CFGL  ,  0xD4  )   /*  DMA Channel 0 Configuration Address Low Byte       */
SFR(  DMA0CFGH  ,  0xD5  )   /*  DMA Channel 0 Configuration Address High Byte      */
SFR(  DMAARM    ,  0xD6  )   /*  DMA Channel Arm                                    */
SFR(  DMAREQ    ,  0xD7  )   /*  DMA Channel Start Request and Status               */

/*  Timers 1/3/4 Interrupt Mask/Flag                                                */
SFRBIT( TIMIF   ,  0xD8 , _TIMIF7, T1OVFIM, T4CH1IF, T4CH0IF, T4OVFIF, T3CH1IF, T3CH0IF, T3OVFIF )
SFR(  RFD       ,  0xD9  )   /*  RF Data                                            */
SFR(  T1CC0L    ,  0xDA  )   /*  Timer 1 Channel 0 Capture/Compare Value Low Byte   */
SFR(  T1CC0H    ,  0xDB  )   /*  Timer 1 Channel 0 Capture/Compare Value High Byte  */
SFR(  T1CC1L    ,  0xDC  )   /*  Timer 1 Channel 1 Capture/Compare Value Low Byte   */
SFR(  T1CC1H    ,  0xDD  )   /*  Timer 1 Channel 1 Capture/Compare Value High Byte  */
SFR(  T1CC2L    ,  0xDE  )   /*  Timer 1 Channel 2 Capture/Compare Value Low Byte   */
SFR(  T1CC2H    ,  0xDF  )   /*  Timer 1 Channel 2 Capture/Compare Value High Byte  */

SFR(  ACC       ,  0xE0  )   /*  Accumulator                                        */
SFR(  RFST      ,  0xE1  )   /*  RF Command Strobe                                  */
SFR(  T1CNTL    ,  0xE2  )   /*  Timer 1 Counter Low                                */
SFR(  T1CNTH    ,  0xE3  )   /*  Timer 1 Counter High                               */
SFR(  T1CTL     ,  0xE4  )   /*  Timer 1 Control And Status                         */
SFR(  T1CCTL0   ,  0xE5  )   /*  Timer 1 Channel 0 Capture/Compare Control          */
SFR(  T1CCTL1   ,  0xE6  )   /*  Timer 1 Channel 1 Capture/Compare Control          */
SFR(  T1CCTL2   ,  0xE7  )   /*  Timer 1 Channel 2 Capture/Compare Control          */

/*  Interrupt Flags 5                                                               */
SFRBIT(  IRCON2 ,  0xE8, _IRCON27, _IRCON26, _IRCON25, WDTIF, P1IF, I2CIF, UTX0IF, P2IF )
SFR(  RFIRQF0   ,  0xE9  )   /*  RF Interrupt Flags LSB                             */
SFR(  T4CNT     ,  0xEA  )   /*  Timer 4 Counter                                    */
SFR(  T4CTL     ,  0xEB  )   /*  Timer 4 Control                                    */
SFR(  T4CCTL0   ,  0xEC  )   /*  Timer 4 Channel 0 Capture/Compare Control          */
SFR(  T4CC0     ,  0xED  )   /*  Timer 4 Channel 0 Capture/Compare Value            */
SFR(  T4CCTL1   ,  0xEE  )   /*  Timer 4 Channel 1 Capture/Compare Control          */
SFR(  T4CC1     ,  0xEF  )   /*  Timer 4 Channel 1 Capture/Compare Value            */

SFR(  B         ,  0xF0  )   /*  B Register                                         */
SFR(  PERCFG    ,  0xF1  )   /*  Peripheral I/O Control                             */
SFR(  ADCCFG    ,  0xF2  )   /*  ADC Input Configuration (legacy name)              */
SFR(  APCFG     ,  0xF2  )   /*  Analog Periferal I/O Configuration                 */
SFR(  P0SEL      , 0xF3  )   /*  Port 0 Function Select                             */
SFR(  P1SEL     ,  0xF4  )   /*  Port 1 Function Select                             */
SFR(  P2SEL     ,  0xF5  )   /*  Port 2 Function Select                             */
SFR(  P1INP     ,  0xF6  )   /*  Port 1 Input Mode                             		*/
SFR(  P2INP     ,  0xF7  )   /*  Port 2 Input Mode 	                                */
SFR(  PPULL     ,  0xF8  )   /*  Port Pullup/Pulldown Control                       */
SFR(  _SFRF9    ,  0xF9  )   /*  Not used                                 		    */
SFR(  _SFRFA    ,  0xFA  )   /*  Not used                                 		    */
SFR(  PPRI      ,  0xFB  )   /*  Peripheral Priority Setup                          */
SFR(  _SFRFC    ,  0xFC  )   /*  Not used                                 		    */

/*  Port direction control                                                          */
SFR(  P0DIR     ,  0xFD  )   /*  Port 0 Direction                                   */
SFR(  P1DIR     ,  0xFE  )   /*  Port 1 Direction                                   */
SFR(  P2DIR     ,  0xFF  )   /*  Port 2 Direction                                   */


/* ------------------------------------------------------------------------------------------------
 *                                       Xdata Radio Registers
 * ------------------------------------------------------------------------------------------------
 */
/* RF core ram */
#define RFCORE_RAM      PXREG( 0x6000 )
#define RFCORE_RAM_SZ   384

/* RF core ram register/general memory page */
#define RFCORE_RAM_PAGE PXREG( 0x6000 )
#define RFCORE_RAM_PAGE_SZ 128

/* FIFO direct access */
#define RXFIFO          PXREG( 0x6080 )
#define RXFIFO_SZ       128
#define TXFIFO          PXREG( 0x6100 )
#define TXFIFO_SZ       128

/* Radio Control Registers */
#define FRMCTRL0       XREG(0x6180)
#define RFIRQM0        XREG(0x6181)
#define RFIRQM1        XREG(0x6182)
#define RFERRM         XREG(0x6183)
#define FREQCTRL       XREG(0x6184)
#define FREQTUNE       XREG(0x6185)
#define TXPOWER        XREG(0x6186)
#define TXCTRL         XREG(0x6187)
#define LLESTAT        XREG(0x6188)
#define _XREG6189      XREG(0x6189)
#define SEMAPHORE0     XREG(0x618A)
#define SEMAPHORE1     XREG(0x618B)
#define SEMAPHORE2     XREG(0x618C)
#define RFSTAT         XREG(0x618D)
#define RSSI           XREG(0x618E)
#define RFPSRND        XREG(0x618F)
#define MDMCTRL0       XREG(0x6190)
#define MDMCTRL1       XREG(0x6191)
#define MDMCTRL2       XREG(0x6192)
#define MDMCTRL3       XREG(0x6193)
#define SW_CONF        XREG(0x6194)
#define SW0            XREG(0x6195)
#define SW1            XREG(0x6196)
#define SW2            XREG(0x6197)
#define SW3            XREG(0x6198)
#define FREQEST        XREG(0x6199)
#define RXCTRL         XREG(0x619A)
#define FSCTRL         XREG(0x619B)
#define LNAGAIN        XREG(0x61A0)
#define AAFGAIN        XREG(0x61A1)
#define ADCTEST0       XREG(0x61A2)
#define MDMTEST0       XREG(0x61A5)
#define MDMTEST1       XREG(0x61A6)
#define ATEST          XREG(0x61A9)
#define RFC_OBS_CTRL0  XREG(0x61AE)
#define RFC_OBS_CTRL1  XREG(0x61AF)
#define RFC_OBS_CTRL2  XREG(0x61B0)
#define LLECTRL        XREG(0x61B1)
#define ACOMPQS        XREG(0x61B6)
#define TXFILTCFG      XREG(0x61BC)
#define RFRND          XREG(0x61BF)

/* FIFO and RF core RAM registers */
#define RFRAMCFG       XREG(0x61C0)
#define _XREG61C1      XREG(0x61C1)
#define _XREG61C2      XREG(0x61C2)
#define RFFDMA0        XREG(0x61C3)
#define RFFDMA1        XREG(0x61C4)
#define RFFSTATUS      XREG(0x61C5)
#define RFFCFG         XREG(0x61C6)

